<template>
	<div class="s-modal">
		<div class="s-modal__scroll">
			<div class="s-modal____content terms">
				<div class="terms__title">Условия и положения</div>
				<div class="terms__date">«8» декабря 2020 г.</div>
				<div class="terms__body">
					<p>
						SCHUTZ именуемый в дальнейшем «Управляющий», с одной стороны, и
						пользователь математического кода «
						{{ user.ethereum_wallet }} », именуемый в дальнейшем «Инвестор», с
						другой стороны, совместно именуемые в дальнейшем «Стороны»,
						заключили настоящее Соглашение о нижеследующем:
					</p>

					<div class="page__list">
						<div class="page__list_item" data-number="1">
							ПРЕДМЕТ СОГЛАШЕНИЯ
						</div>
						<div class="page__list_item" data-number="1.1">
							Управляющий обязуется принять в управление цифровые активы и
							управлять ими в течение срока действия настоящего вклада.
						</div>
						<div class="page__list_item" data-number="1.2">
							Технологией по приему и выдачи цифровых активов выступает
							централизованный смарт-контракт на базе блокчейна Эфириума
							(Ethereum) Schutz. Данный смарт-контракт не влияет на получение
							прибыли Управляющим, а лишь является автоматизированной платформой
							- электронным бухгалтером SCHUTZ.
						</div>
						<div class="page__list_item" data-number="1.3">
							Управляющий обязуется управлять цифровыми спекулятивные операции
							на биржевом рынке в целях Инвестора прибыли от колебаний курсов в
							течение Управляющий имеет право на свое усмотрение выбирать сделки
							для извлечения прибыли в пользу Инвестора.
						</div>
						<div class="page__list_item" data-number="1.4">
							Расчетный период определяется условиями тарифного плана.
						</div>
						<div class="page__list_item" data-number="1.5">
							Заключение Соглашения между Управляющим и Инвестором, вместе
							именуемыми – «Стороны», осуществляется путем полного и
							безоговорочного присоединения Клиента к Соглашению (акцепта
							Соглашения) в соответствии со ст. 428 Гражданского кодекса
							Российской Федерации.
						</div>
						<div class="page__list_item" data-number="1.6">
							В рамках настоящего Соглашения допускается внесение цифровых
							токенов на криптовалютный кошелек Управляющего. Возврат объектов
							управления или процентов по ним осуществляются в цифровых токенах.
							Передача цифровых активов в доверительное управление не влечет
							перехода права собственности на них к Управляющему.
						</div>
						<div class="page__list_item" data-number="1.7">
							Передача в доверительное управление цифровых активов
							осуществляется Инвестором путем перечисления цифровых активов на
							кошелек Управляющего. Днем передачи цифровых активов Инвестора в
							доверительное управление считается день их поступления на кошелек
							Управляющего.
						</div>
						<div class="page__list_item" data-number="1.8">
							Перечисления начисленных процентов на суммы переданных в
							управление средств («тела депозита») происходят за каждый квартал
							(первый квартал 15-20 апреля, второй квартал 15-20 июля, третий
							квартал 15-20 октября, четвертый квартал 15-20 января), за
							исключением выходных и праздничных дней.
						</div>
						<div class="page__list_item" data-number="1.9">
							Выгодоприобретателем по Договору является Инвестор.
						</div>

						<div class="page__list_item" data-number="2">
							ПРАВА И ОБЯЗАННОСТИ СТОРОН
						</div>
						<div class="page__list_item" data-number="2.1">
							Права и обязанности Управляющего:
						</div>
						<div class="page__list_item" data-number="2.1.1">
							Использовать переданные Инвестором в управление средства
							исключительно в целях извлечения в пользу Инвестора спекулятивной
							прибыли, управляя средствами путем совершения сделок купли-продажи
							на биржевом рынке с целевой доходностью согласно условиям
							тарифного плана. Действовать добросовестно и тем способом, который
							является наилучшим для интересов Инвестора.
						</div>
						<div class="page__list_item" data-number="2.1.2">
							В случае наступления форс-мажорных обстоятельств Управляющий
							вправе менять (повышать или снижать) процент прибыли, заявленный
							согласно тарифному плану, уведомив другую Сторону в срок не менее,
							чем за 30 календарных дней.
						</div>
						<div class="page__list_item" data-number="2.1.3">
							Управляющий вправе изменять данное «Соглашение», а также
							«Ограничение отвественности» без обязательства уведомления клиента
							о внесенных изменениях в вышеупомянутые документы.
						</div>
						<div class="page__list_item" data-number="2.2">
							Права и обязанности Инвестора:
						</div>
						<div class="page__list_item" data-number="2.2.1">
							Инвестор обязан принять условия тарифного плана, описанные в
							данном «Соглашении», а также
							<a
								href="/files/Ogranicheniye_otvetstvennosti.pdf"
								target="_blank"
								rel="noopener noreferrer"
							>
								«Ограничение ответственности»</a
							>.
						</div>
						<div class="page__list_item" data-number="2.2.2">
							Инвестор не в праве вмешиваться в деятельность управляющего по
							Доверительному управлению активами.
						</div>
						<div class="page__list_item" data-number="2.2.3">
							Инвестор обязуется зафиксировать полученную прибыль путем вывода
							или реинвестирования всего объема средств в период не позднее чем
							3 календарных года с даты открытого депозита. В противном случае
							итоговый баланс (итоговая сумма депозита и ежеквартальных выплат)
							будет списан со счета Инвестора в пользу Компании.
						</div>
						<div class="page__list_item" data-number="2.2.4">
							По истечению срока работы вклада Инвестор обязуется подать заявку
							на вывод/пролонгацию тела депозита посредством нажатия на кнопку
							«Вывести/пролонгировать мой депозит» заблаговременно, до конца
							месяца, после которого планируется вывод/пролонгация. В противном
							случае администрация проекта перенесет вывод/пролонгацию тела
							депозита Инвестора на 1 месяц позднее предусмотренного тарифным
							планом. <br />
							Пример: вывод тела депозита по тарифному плану назначен на 20-22
							февраля 2021 г., Инвестору необходимо подать заявку на
							вывод/пролонгацию до конца января 2021. Если Инвестор просрочил
							подачу заявку
						</div>
						<div class="page__list_item" data-number="2.2.5">
							Инвестор имеет право пополнять депозит, а также реинвестировать
							полученные ежеквартальные проценты на протяжении всего срока
							работы депозита (12 мес). В этом случае изначальная сумма депозита
							будет пополнена на сумму пополнения и/или реинвестированных
							средств. При этом сумма выплат по следующим отчетным периодам
							(кварталам) увеличится соответственно. Вывод итоговой суммы
							депозита будет произведен по первоначальной дате открытия
							депозита.
						</div>
						<div class="page__list_item" data-number="2.2.6">
							<strong> Изменение платежных реквизитов получателя. </strong>В
							случае потери Инвестором доступа к кошельку (математическому
							коду), который привязан к личному кабинету и с которого был открыт
							депозит, Инвестору необходимо уведомить службу поддержки SCHUTZ
							через e-mail обращение. Управляющий предложит Инвестору процедуру
							восстановления доступа к депозиту.
						</div>

						<div class="page__list_item" data-number="2.2.7">
							Инвестор несет ответственность за уплату всех налоговых
							обязательств (налог на доходы физических лиц), Инвестор обязан
							исполнять (исчислять и уплачивать) все выплаты самостоятельно.
							Ответственность за неисполнение (ненадлежащее исполнение)
							налоговых обязательств Инвестор несет самостоятельно.
						</div>
						<div class="page__list_item" data-number="2.2.8">
							Инвестор подтверждает, что он уведомлен о возможных рисках по
							ведению спекулятивных сделок с цифровыми активами.
						</div>

						<div class="page__list_item" data-number="3">
							СРОК ДЕЙСТВИЯ СОГЛАШЕНИЯ
						</div>
						<div class="page__list_item" data-number="3.1">
							Цифровые активы Инвестора должны быть перечислены на кошелек
							Управляющего в срок не более 1 (одного) календарного дня с момента
							подписания настоящего Соглашения. Настоящее Соглашение вступает в
							силу с момента завершения транзакции согласно условиям тарифного
							плана и действует до момента его расторжения.
						</div>
						<div class="page__list_item" data-number="3.2">
							Расторжение настоящего Соглашения возможно только по окончании
							срока действия депозита. Каждая из Сторон настоящего Соглашения
							вправе в одностороннем порядке расторгнуть настоящее Соглашение,
							предупредив об этом другую Сторону не менее, чем за 5 (пять)
							рабочих дней до завершения очередного расчетного периода
							посредством e-mail уведомления.
						</div>
						<div class="page__list_item" data-number="3.3">
							По заявлению любой из Сторон настоящее Соглашение может быть
							расторгнуто в одностороннем порядке в случае наступления
							<a
								href="/Ограничение_Отвественности.pdf"
								target="_blank"
								rel="noopener noreferrer"
								>обстоятельств непреодолимой силы (форс-мажор), повлиявших на
								возможность исполнения настоящего Соглашения.</a
							>. При этом, Сторона, ссылающаяся на обстоятельства непреодолимой
							силы в качестве основания для расторжения настоящего Соглашения,
							должна представить другой Стороне полученные из компетентных
							органов доказательства наступления обстоятельств непреодолимой
							силы и степень их влияния на невозможность исполнения настоящего
							Соглашения, например, <br />
							- издание нормативных актов, положения которых обуславливают
							невозможность надлежащего исполнения обязательств; <br />
							- возникновение стихийных бедствий, в том числе наводнений,
							землетрясений, пожаров и др.; <br />
							- влияние социально-политических факторов, в том числе забастовок,
							митингов, шествий, действий органов власти, военных действий или
							конфликтов, террористических актов; <br />
							- прекращение (приостановление) деятельности организаторов торгов;
							<br />
							- невыплата онлайн-биржами
							<a
								href="https://poloniex.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://poloniex.com</a
							>
							<a
								href="https://www.binance.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://www.binance.com</a
							>
							<a
								href="https://bitmex.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://bitmex.com</a
							>
							<a
								href="https://bitfinex.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://bitfinex.com</a
							>
							<a
								href="https://bittrex.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://bittrex.com</a
							>
							<a
								href="https://hitbtc.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://hitbtc.com</a
							>
							<a
								href="https://www.okex.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://www.okex.com</a
							>
							<a
								href="https://www.hbg.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://www.hbg.com</a
							>
							<a
								href="https://lykke.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://lykke.com</a
							>
							причитающихся платежей, осуществление несвоевременных выплат или
							иные действия, не поддающиеся контролю со стороны Управляющего.
							<br />
							- Атака мошенниками на аккаунты управляющего и хищение ими
							средств. (Полный список пунктов содержит документ
							<a href="/files/Ogranicheniye_otvetstvennosti.pdf" target="_blank"
								>«Ограничение отвественности»</a
							>
							)
						</div>
						<div class="page__list_item" data-number="3.4">
							Настоящее Соглашение также может быть расторгнуто по взаимному
							соглашению Сторон.
						</div>
						<div class="page__list_item" data-number="4">
							ОТВЕТСТВЕННОСТЬ СТОРОН
						</div>

						<div class="page__list_item" data-number="">
							Предлагаемые цифровые финансовые активы являются
							высокорискованными, и их приобретение может привести к потере
							внесенных денежных средств в полном объеме. До совершения сделок с
							предлагаемыми цифровыми финансовыми активами следует ознакомиться
							с рисками, с которыми связано их приобретение.
						</div>
						<div class="page__list_item" data-number="4.1">
							Заключая настоящее Соглашение, Инвестор уведомлен об имущественных
							рисках, связанных с досрочным выводом цифровых активов.
						</div>
						<div class="page__list_item" data-number="4.2">
							Управляющий или Инвестор не будет нести ответственность за
							неисполнение или ненадлежащее исполнение обязательств по Договору,
							если это будет являться следствием обстоятельств непреодолимой
							силы (форс-мажор), указанных в данном Договоре (Форс-мажорные
							обстоятельства), или следствием неисполнения или ненадлежащего
							исполнения обязательств по Договору другой Стороной.
						</div>
						<div class="page__list_item" data-number="4.3">
							Инвестор заверяет Управляющего в том, что принимает на себя все
							независящие от воли Управляющего риски, связанные с непреодолимыми
							обстоятельствами (форс-мажор), которые не зависят от действия
							Управляющего и на которые Управляющий не может повлиять каким-либо
							образом.
						</div>
						<div class="page__list_item" data-number="4.4">
							Инвестор подтверждает, что имеет базовые знания о цифровых активах
							и возможных видах их торговле на рынке. Инвестор подтверждает, что
							передает цифровые активы в доверительное управление с осознанием
							того, что Управляющий будет совершать спекулятивные сделки на
							рынке цифровых активов с целью извлечения прибыли для Инвестора.
						</div>
						<div class="page__list_item" data-number="4.5">
							В случае введения соответствующих требований по регулированию
							криптовалют в стране, резидентом которой является инвестор, он
							должен пройти все необходимые страной требования, чтобы иметь
							возможность продолжить работу с управляющим.
						</div>
						<div class="page__list_item" data-number="4.6">
							Все переводы цифровых активов с кошелька Инвестора конвертируются
							в стейблкоины исключительно для точного расчета в тарифах по курсу
							на онлайн- бирже
							<a
								href="https://poloniex.com"
								target="_blank"
								rel="noopener noreferrer"
								>https://poloniex.com</a
							>
							на момент поступления средств на кошелек Управляющего.
						</div>
						<div class="page__list_item" data-number="5">
							КОНФИДЕНЦИАЛЬНОСТЬ:
						</div>
						<div class="page__list_item" data-number="5.1">
							Ни одна из Сторон Договора не имеет права, кроме как по требованию
							компетентного органа или суда, в течение срока действия и после
							прекращения действия Договора в течение 3 (Трех) лет, разглашать
							какому-либо лицу, не уполномоченному одной из Сторон, информацию,
							относящуюся к Договору, за исключением информации, которая может
							быть получена из общедоступных источников.
						</div>
						<div class="page__list_item" data-number="5.2">
							Инвестор дает свое согласие на предоставление своих персональных
							данных указанным лицам Управляющего и уведомлен о своем праве в
							любое время отозвать свое согласие на обработку персональных
							данных.
						</div>
						<div class="page__list_item" data-number="6">
							ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ
						</div>
						<div class="page__list_item" data-number="6.1">
							Споры и разногласия, которые могут возникнуть при исполнении
							настоящего Соглашения, будут по возможности разрешаться путем
							переговоров между Сторонами.
						</div>
						<div class="page__list_item" data-number="7">
							ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
						</div>
						<div class="page__list_item" data-number="7.1">
							Стороны признают юридическую силу настоящего Соглашения
						</div>
						<div class="page__list_item" data-number="7.2">
							Заполняя настоящее соглашение инвестор соглашается с обработкой
							своих персональных данных управляющим.
						</div>
					</div>
				</div>
			</div>
		</div>
		<div class="terms__acception">
			<div
				class="terms__cancel"
				@click="$store.commit('toggleTermsModal', false)"
			>
				Отменить, не согласен
			</div>
			<button
				@click="accept()"
				class="button terms__accept custom-button is-primary is-size-5 has-text-weight-bold"
			>
				Принять
			</button>
		</div>
	</div>
</template>

<script>
import { mapGetters } from "vuex";
export default {
	methods: {
		accept() {
			this.$emit("accepted", true);
			this.$store.commit("toggleTermsModal", false);
		}
	},
	computed: {
		...mapGetters(["user"])
	}
};
</script>

<style lang="scss" scoped>
.terms {
	font-weight: 300;
	font-size: 14px;
	line-height: 19px;
	color: #666666;
	&__acception {
		display: flex;
		align-items: center;
		justify-content: space-between;
		padding-right: 27px;
		padding-top: 10px;
	}
	&__cancel {
		font-weight: 300;
		font-size: 14px;
		line-height: 19px;
		color: #30a1ff;
		border-bottom: 1px dashed;
		cursor: pointer;
	}
	&__accept {
		width: 100%;
		max-width: 400px;
	}
	&__title {
		font-weight: normal;
		font-size: 24px;
		line-height: 120%;
		color: #000000;
	}
	&__date {
		margin-top: 1px;
		margin-bottom: 15px;
	}
	p {
		margin-bottom: 20px !important;
	}
}
</style>
