<template>
  <div class="hero-body">
    <h1 class="title is-1">Terms and conditions</h1>
    <p>
      <h4 class="subtitle is-4">«15» мая 2020 г.</h4>
      <p class="subtitle is-5">
      NTS Crypto, именуемый в дальнейшем «Управляющий», с одной
      стороны, и пользователь математического кода «{{metamaskWallet}}», именуемый в дальнейшем
      «Инвестор», с другой стороны, совместно именуемые в дальнейшем «Стороны»,
      заключили настоящее Соглашение о нижеследующем:
      </p>

      <p class="title is-6">2. ПРЕДМЕТ СОГЛАШЕНИЯ</p>

      2.1. Управляющий обязуется принять в управление цифровые активы и управлять ими в течение срока действия настоящего вклада.<br>
      2.2. Технологией по приему и выдачи цифровых активов выступает централизованный смарт-контракт на базе блокчейна Эфириума (Ethereum) Neutrino Token Standart (NTS). Данный смарт-контракт не влияет на получение прибыли Управляющим, а лишь является автоматизированной платформой - электронным бухгалтером NTS Crypto.<br>
      2.3. Управляющий обязуется управлять цифровыми активами, совершая спекулятивные операции на биржевом рынке в целях извлечения в пользу Инвестора прибыли от колебаний курсов в течение расчетного периода. Управляющий имеет право на свое усмотрение выбирать любые спекулятивные сделки для извлечения прибыли в пользу Инвестора.<br>
      2.4. Расчетный период определяется условиями тарифного плана.<br>
      2.5. Заключение Соглашения между Управляющим и Инвестором , вместе именуемыми – «Стороны», осуществляется путем полного и безоговорочного присоединения Клиента к Соглашению (акцепта Соглашения) в соответствии со ст. 428 Гражданского кодекса Российской Федерации.<br>
      2.6. В рамках настоящего Соглашения допускается внесение цифровых токенов на криптовалютный кошелек Управляющего. Возврат объектов управления или процентов по ним осуществляются в цифровых токенах. Передача цифровых активов в доверительное управление не влечет перехода права собственности на них к Управляющему.<br>
      2.7. Передача в доверительное управление цифровых активов осуществляется Инвестором путем перечисления цифровых активов на кошелек Управляющего. Днем передачи цифровых активов Инвестора в доверительное управление считается день их поступления на кошелек Управляющего.<br>
      2.8. Перечисления начисленных процентов на суммы переданных в управление средств («тела депозита») происходит за каждый квартал (первый квартал 15-20 апреля, второй квартал 15-20 июля, третий квартал 15-20 октября, четвертый квартал 15-20 января), за исключением выходных и праздничных дней.<br>
      2.9. Выгодоприобретателем по Договору является Инвестор.
      <p class="title is-6">3. ПРАВА И ОБЯЗАННОСТИ СТОРОН</p>
      3.1. Права и обязанности Управляющего:<br>
      3.1.1. Использовать переданные Инвестором в управление средства исключительно в целях извлечения в пользу Инвестора спекулятивной прибыли, управляя средствами путем совершения сделок купли-продажи на биржевом рынке с целевой доходностью согласно условиям тарифного плана. Действовать добросовестно и тем способом, который является наилучшим для интересов Инвестора.<br>
      3.1.2. В случае наступления форс-мажорных обстоятельств Управляющий вправе менять (повышать или снижать) процент прибыли, заявленный согласно тарифному плану, уведомив другую Сторону в срок не менее, чем за 30 календарных дней.<br>
      3.1.3. Управляющий вправе изменять данное «Соглашение», «Ограничение отвественности» и «Регламент ввода/вывода средств», без обязательства уведомления клиента о внесенных изменениях в вышеупомянутые документы.<br>
      3.2. Права и обязанности Инвестора:<br>
      3.2.1. Инвестор обязан принять условия тарифного плана, в том числе
      предусмотренные им <a href="/Ограничение_Отвественности.pdf" target="_blank" rel="noopener noreferrer"> регламент ввода/вывода цифровых активов.</a> <br> 3.2.2. Инвестор не праве
      вмешиваться в деятельность управляющего по Доверительному управлению
      активами. <br> 3.2.3. Инвестор обязуется фиксировать полученную путем вывода
      или реинвестирования всего объема полученной прибыли в срок до 3-х
      календарных лет с даты открытого депозита. В противном случае итоговый
      баланс (итоговая сумма депозита и ежеквартальных выплат) будет списан со
      счета Инвестора в пользу Компании. <br> 3.2.4. И н в е с т о р о б я з у е
      т с я п о и с т е ч е н и ю п о л н о г о с р о к а работы депозита
      произвести вывод тела депозита, нажав «вывод тела депозита». В противном
      случае, во избежание риска потери средств инвестором Управляющий
      автоматически продлит срок работы депозита на период следующих 12 месяцев
      (или на период, установленный тарифным планом). <br> 3.2.5. Инвестор несет
      ответственность за уплату всех налоговых обязательств (налог на доходы
      физических лиц), Инвестор обязан исполнять (исчислять и уплачивать) все
      выплаты самостоятельно. Ответственность за неисполнение (ненадлежащее
      исполнение) налоговых обязательств Инвестор несет самостоятельно. <br> 3.2.6
      Инвестор подтверждает, что он уведомлен о возможных рисках по ведению
      спекулятивных сделок с цифровыми активами.
      <p class="title is-6">4. СРОК ДЕЙСТВИЯ СОГЛАШЕНИЯ</p>
      4.1. Цифровые активы Инвестора должны быть перечислены на кошелек Управляющего в срок не более 1 (одного) календарного дня с момента подписания настоящего Соглашения. Настоящее Соглашение вступает в силу с момента завершения транзакции согласно условиям тарифного плана и действует до момента его расторжения.<br>
      4.2. Расторжение настоящего Соглашения возможно только по окончании срока действия депозита. Каждая из Сторон настоящего Соглашения вправе в одностороннем порядке расторгнуть настоящее Соглашение, предупредив об этом другую Сторону не менее, чем за 5 (пять) рабочих дней до завершения очередного расчетного периода посредством e-mail уведомления.<br>
      4.3. По заявлению любой из Сторон настоящее Соглашение может быть расторгнуто в одностороннем порядке в случае наступления <a href="/Ограничение_Отвественности.pdf" target="_blank" rel="noopener noreferrer">обстоятельств непреодолимой силы (форс-мажор),
      повлиявших на возможность исполнения настоящего Соглашения.</a> При этом, Сторона, ссылающаяся на обстоятельства непреодолимой силы в качестве основания для расторжения настоящего Соглашения, должна представить другой Стороне полученные из компетентных органов доказательства наступления обстоятельств непреодолимой силы и степень их влияния на невозможность исполнения настоящего Соглашения, например, - издание нормативных актов, положения
      которых обуславливают невозможность надлежащего исполнения обязательств; -
      возникновение стихийных бедствий, в том числе наводнений, землетрясений,
      пожаров и др.; - влияние социально-политических факторов, в том числе
      забастовок, митингов, шествий, действий органов власти, военных действий
      или конфликтов, террористических актов; - прекращение (приостановление)
      деятельности организаторов торгов; - невыплата онлайн-биржами <a href="https://poloniex.com" target="_blank" rel="noopener noreferrer">https://poloniex.com</a>
      <a href="https://www.binance.com" target="_blank" rel="noopener noreferrer">https://www.binance.com</a>
  <a href="https://bitmex.com" target="_blank" rel="noopener noreferrer">https://bitmex.com</a>
      <a href="https://bitfinex.com" target="_blank" rel="noopener noreferrer">https://bitfinex.com</a>
      <a href="https://bittrex.com" target="_blank" rel="noopener noreferrer">https://bittrex.com</a>
      <a href="https://hitbtc.com" target="_blank" rel="noopener noreferrer">https://hitbtc.com</a>
      <a href="https://www.okex.com" target="_blank" rel="noopener noreferrer">https://www.okex.com</a>
      <a href="https://www.hbg.com" target="_blank" rel="noopener noreferrer">https://www.hbg.com</a>
      <a href="https://lykke.com" target="_blank" rel="noopener noreferrer">https://lykke.com</a>
       причитающихся
      платежей, осуществление несвоевременных выплат или иные действия, не
      поддающиеся контролю со стороны Управляющего. - Атака мошенниками на
      аккаунты управляющего и хищение ими средств. (Полный список пунктов
      содержит документ «Ограничение отвественности») <br>
      4.4. Настоящее Соглашение также может быть расторгнуто по взаимному соглашению Сторон.
      <p class="title is-6">5.ОТВЕТСТВЕННОСТЬ СТОРОН</p>
      Предлагаемые цифровые финансовые активы являются высокорискованными, и их приобретение может привести к потере внесенных денежных средств в полном объеме. До совершения сделок с предлагаемыми цифровыми финансовыми активами следует ознакомиться с рисками, с которыми связано их приобретение.<br>

      5.1. Заключая настоящее Соглашение, Инвестор уведомлен об имущественных рисках, связанных с досрочным выводом цифровых активов.<br>
      5.2. Управляющий или Инвестор не будет нести ответственность за неисполнение или ненадлежащее исполнение обязательств по Договору, если это будет являться следствием обстоятельств непреодолимой силы (форс-мажор), указанных в данном Договоре (Форс-мажорные обстоятельства), или следствием неисполнения или ненадлежащего исполнения обязательств по Договору другой Стороной.<br>
      5.3. Инвестор заверяет Управляющего в том, что принимает на себя все независящие от воли Управляющего риски, связанные с непреодолимыми обстоятельствами (форс-мажор), которые не зависят от действия Управляющего и на которые Управляющий не может повлиять каким-либо образом.<br>
      5.4. Инвестор подтверждает, что имеет базовые знания о цифровых активах и возможных видах их торговле на рынке. Инвестор подтверждает, что передает цифровые активы в доверительное управление с осознанием того, что Управляющий будет совершать спекулятивные сделки на рынке цифровых активов с целью извлечения прибыли для Инвестора.<br>
      5.5. В случае введения соответствующих требований по регулированию криптовалют в стране, резидентом которой является инвестор, он должен пройти все необходимые страной требования, чтобы иметь возможность продолжить работу с управляющим.<br>
      5.6. Все переводы цифровых активов с кошелька Инвестора конвертируются в стейблкоины исключительно для точного расчета в тарифах по курсу на онлайн- бирже <a href="https://poloniex.com" target="_blank" rel="noopener noreferrer">https://poloniex.com</a> на момент поступления средств
      на кошелек Управляющего.
      <p class="title is-6">6. КОНФИДЕНЦИАЛЬНОСТЬ:</p>
      6.1. Ни одна из Сторон Договора не имеет права, кроме как по требованию компетентного органа или суда, в течение срока действия и после прекращения действия Договора в течение 3 (Трех) лет, разглашать какому-либо лицу, не уполномоченному одной из Сторон, информацию, относящуюся к Договору, за исключением информации, которая может быть получена из общедоступных источников.<br>
      6.2. Инвестор дает свое согласие на предоставление своих персональных данных указанным лицам Управляющего и уведомлен о своем праве в любое время отозвать свое согласие на обработку персональных данных.
      <p class="title is-6">7. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</p>
      7.1. Споры и разногласия, которые могут возникнуть при исполнении настоящего Соглашения, будут по возможности разрешаться путем переговоров между Сторонами.
      <p class="title is-6">8. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</p>
      8.1. Стороны признают юридическую силу настоящего Соглашения.<br>
      8.2. Заполняя настоящее соглашение инвестор соглашается с обработкой своих персональных данных управляющим.<br>
    </p>
    <div>
      <b-button type="is-primary" @click="accept">Принять</b-button>
    </div>
  </div>
</template>

<script>
import AddFundsModal from "../components/modals/AddFundsModal";
export default {
  name: "terms-and-conditions",
  layout: "auth",
  components: {AddFundsModal},
  methods: {
    accept() {
      this.$store.dispatch('passTermsAgreement')
      this.$router.go(-1)
      this.$buefy.modal.open({
        parent: this,
        component: AddFundsModal,
        hasModalCard: true,
        customClass: "custom-class custom-class-2",
        trapFocus: true,
        confirmText: "Ok"
      });
    }
  },
  computed: {
    metamaskWallet() {
      return window.ethereum.selectedAddress
    }
  },
};
</script>

<style scoped>
.hero-body {
  max-width: 1000px;
  width: 100%;
  margin: 0 auto;
}
p {
  margin: 20px 0 !important;
  padding: 0;
}
</style>
